app/Controllers/Home.php

SELECT *
FROM `places`
SELECT *
FROM `categories`
SELECT *
FROM `reviews`
---
    public function index(): string
    {
        //Model Load
        $tourModel = new ToursModel();
        $placeModel = new PlacesModel();
        $categoryModel = new CategoriesModel();
        $reviewModel = new ReviewsModel();



        //get value through Model
        $tourdetails = $tourModel->getToursDetails();

        $places = $placeModel->findAll();
        $categories = $categoryModel->findAll();
        $reviews = $reviewModel->findAll();

SELECT *
FROM `places`
WHERE `tours_id` = '2'
SELECT *
FROM `accomodations`
WHERE `tours_id` = '2'
SELECT *
FROM `itineraries`
WHERE `tours_id` = '2'
---
    public function tourdetails($id)
    {
        helper('form');

        $tourModel = new ToursModel();
        $placeModel = new PlacesModel();
        $accoModel = new AccomodationModel();
        $itinerariesModel = new ItinerariesModel();
        $tourdetails = $tourModel->getTourDetailsbyId($id);
        $places = $placeModel->select()->where('tours_id', $id)->findAll();
        $acc = $accoModel->select()->where('tours_id', $id)->findAll();
        $iti = $itinerariesModel->select()->where('tours_id', $id)->findAll();

SELECT `title`
FROM `tours`
WHERE `id` = '2'
 LIMIT 1
---
    public function bookTour($id)
    {
        helper('form');
        $session = session();
        if ($this->request->getMethod() === 'get') {

            $tourModel = new ToursModel();

            $tour = $tourModel->select('title')->where('id', $id)->first();

INSERT INTO `tour_bookings` (`tours_id`, `name`, `email`, `phone_no`, `message`, `people`, `journey_date`, `created_at`, `updated_at`) VALUES ('2', 'Paas', 'pabitraazaz@gmail.com', '86', 'Hi', '12', 'kj', '2023-10-18 18:52:12', '2023-10-18 18:52:12')
---
            )) {
                $tourBookingModel = new TourBookModel();

                $result = $tourBookingModel->save([
                    'tours_id' => $id,
                    'name' => $this->request->getPost('name'),
                    'email' => $this->request->getPost('email'),
                    'phone_no' => $this->request->getPost('phone'),
                    'message' => $this->request->getPost('message'),
                    'people' => $this->request->getPost('people'),
                    'journey_date' => $this->request->getPost('journey_date'),
                ]);