app/Models/TourBookModel.php

SELECT `tour_bookings`.`id` as `id`, `tour_bookings`.`name` as `name`, `tour_bookings`.`email` as `email`, `tour_bookings`.`phone_no` as `phone_no`, `tour_bookings`.`message` as `message`, `tour_bookings`.`people` as `people`, `tour_bookings`.`journey_date` as `journey_date`, `tours`.`title` as `title`
FROM `tour_bookings`
JOIN `tours` ON `tour_bookings`.`tours_id`=`tours`.`id`
---
    public function getTour()
    {
        $result = $this->select('tour_bookings.id as id , tour_bookings.name as name , tour_bookings.email as email , tour_bookings.phone_no as phone_no ,tour_bookings.message as message , tour_bookings.people as people, tour_bookings.journey_date as journey_date ,tours.title as title')->join('tours', 'tour_bookings.tours_id=tours.id')->findAll();