app/Models/ToursModel.php

SELECT `tours`.`id` as `tours_id`, `tours`.`cover_image` as `tour_cover_image`, `tours`.`continent` as `continent`, `tours`.`title` as `tours_title`, `tours`.`short_description` as `tours_sh_desc`, `tours`.`price` as `tours_price`, `tours`.`duration` as `tours_duration`, `tours`.`journey_date_1` as `tours_j1`, `tours`.`journey_date_2` as `tours_j2`, `tours`.`journey_date_3` as `tours_j3`, `tours`.`trip_map_description` as `tours_trip_map_description`, `tours`.`trip_map_image` as `tours_tmap`, `categories`.`name` as `c_name`
FROM `tours`
JOIN `categories` ON `tours`.`categories` = `categories`.`id`
---
    public function getToursDetails()
    {
        $result = $this->select('tours.id as tours_id, tours.cover_image as tour_cover_image ,tours.continent as continent, tours.title as tours_title , tours.short_description  as tours_sh_desc ,tours.price as tours_price , tours.duration as tours_duration, tours.journey_date_1 as tours_j1 , tours.journey_date_2 as tours_j2 , tours.journey_date_3 as tours_j3, tours.trip_map_description as tours_trip_map_description, tours.trip_map_image as tours_tmap , categories.name as c_name')->join('categories', 'tours.categories = categories.id')->findAll();

SELECT `tours`.`id` as `tours_id`, `tours`.`categories` as `tours_cat`, `tours`.`cover_image` as `tours_c_image`, `tours`.`title` as `tours_title`, `tours`.`short_description` as `tours_sh_desc`, `tours`.`price` as `tours_price`, `tours`.`duration` as `tours_duration`, `tours`.`journey_date_1` as `tours_j1`, `tours`.`journey_date_2` as `tours_j2`, `tours`.`journey_date_3` as `tours_j3`, `tours`.`trip_map_description` as `tours_tmap_desc`, `tours`.`trip_map_image` as `tours_tmap_image`, `categories`.`name` as `c_name`
FROM `tours`
JOIN `categories` ON `tours`.`categories` = `categories`.`id`
WHERE `tours`.`id` = '2'
 LIMIT 1
---
    public function getTourDetailsbyId($tour_id)
    {
        $result = $this->select('tours.id as tours_id , tours.categories as tours_cat , tours.cover_image as tours_c_image , tours.title as tours_title , tours.short_description as tours_sh_desc , tours.price as tours_price , tours.duration as tours_duration ,tours.journey_date_1 as tours_j1 , tours.journey_date_2 as tours_j2 ,tours.journey_date_3 as tours_j3,tours.trip_map_description as tours_tmap_desc ,tours.trip_map_image as tours_tmap_image, categories.name as c_name')->join('categories', 'tours.categories = categories.id')->where('tours.id', $tour_id)->first();